# Create Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitLinkInstance..::..Create Method
RevitLinkInstance Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId) | Creates a new instance of a linked Revit project (RevitLinkType). |
| Create(Document, ElementId, ImportPlacement) | Creates a new instance of a linked Revit project (RevitLinkType). |

# See Also
RevitLinkInstance Class
RevitLinkInstance Members
Autodesk.Revit.DB Namespace